c/axis2c/guththila/tests/resources/soap/whitespacedMessage.xml

<?xml version='1.0' ?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">

    <env:Header>


        <wsa:MessageID env:mustUnderstand="0">
            uuid:920C5190-0B8F-11D9-8CED-F22EDEEBF7E5</wsa:MessageID>
        <wsa:To env:mustUnderstand="0">
            http://localhost:8081/axis/services/BankPort</wsa:To>
        <wsa:From env:mustUnderstand="0">
            <Address xmlns="http://schemas.xmlsoap.org/ws/2004/03/addressing">
                http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous
            </Address>
        </wsa:From>

    </env:Header>
    <env:Body>


        <axis2:echoVoid xmlns:axis2="http://ws.apache.org/axis2">
        </axis2:echoVoid>


    </env:Body>
</env:Envelope>